### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [208]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [209]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [210]:
player = purchase_data["SN"].value_counts()
player.head()

Lisosia93      5
Idastidru52    4
Iral74         4
Asur53         3
Phyali88       3
Name: SN, dtype: int64

In [211]:
player_count = len(purchase_data["SN"].unique())
player_count

576

In [212]:
player_count_df = pd.DataFrame({"Total Players": [player_count]})
player_count_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [213]:
items_name = purchase_data["Item Name"].value_counts()
items_name.head()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Fiery Glass Crusader                             9
Nirvana                                          9
Extraction, Quickblade Of Trembling Hands        9
Name: Item Name, dtype: int64

In [214]:
unique_item_count = len(purchase_data["Item Name"].unique())
unique_item_count

179

In [215]:
average_price = purchase_data["Price"].mean()
average_price

3.0509871794871795

In [216]:
purchase_count = purchase_data["Purchase ID"].count()
purchase_count

780

In [217]:
revenue = purchase_data["Price"].sum()
revenue

2379.77

In [218]:
summary_df = pd.DataFrame({"Number of Unique Items":[unique_item_count],
                          "Average Price":[average_price],
                          "Number of Purchases":[purchase_count],
                          "Total Revenue":[revenue]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [219]:
summary_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [220]:
summary_df["Average Price"]= pd.to_numeric(summary_df["Average Price"])

In [221]:
summary_df["Average Price"] = summary_df["Average Price"].astype(float).map("${:,.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].astype(float).map("${:,.2f}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

In [420]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [421]:
gender_demographics = purchase_data[["SN","Gender"]]
gender_demographics

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [422]:
updated_gender_demographics = gender_demographics.drop_duplicates()
updated_gender_demographics

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [437]:
gender_list = list(updated_gender_demographics["Gender"].unique())
gender_list

['Male', 'Other / Non-Disclosed', 'Female']

In [439]:
updated_gender_list = ["Male", "Female", "Other / Non-Disclosed"]
updated_gender_list

['Male', 'Female', 'Other / Non-Disclosed']

In [441]:
male_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Male"])
male_count

484

In [442]:
female_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Female"])
female_count

81

In [443]:
others_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Other / Non-Disclosed"])
others_count

11

In [444]:
player_count = len(purchase_data["SN"].unique())
player_count

576

In [445]:
total_count = [male_count,
             female_count,
             others_count]
total_count

[484, 81, 11]

In [446]:
gender_percentage = [(male_count/player_count)*100,
             (female_count/player_count)*100,
            (others_count/player_count)*100]
gender_percentage

[84.02777777777779, 14.0625, 1.9097222222222223]

In [447]:
gender_demographics_df = pd.DataFrame({"": updated_gender_list,"Total Count": total_count,
                                       "Percentage of Players": gender_percentage})
gender_demographics_df

                          Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [448]:
gender_demographics_df.set_index("", inplace=True)
gender_demographics_df

                       Total Count  Percentage of Players

Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [449]:
gender_demographics_df.dtypes

Total Count                int64
Percentage of Players    float64
dtype: object

In [450]:
gender_demographics_df["Percentage of Players"]= pd.to_numeric(gender_demographics_df["Percentage of Players"])

In [451]:
gender_demographics_df["Percentage of Players"] = gender_demographics_df["Percentage of Players"].astype(float).map("{:,.2f}%".format)
gender_demographics_df

                       Total Count Percentage of Players

Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame